[
    {
        "creatorName": "Dr. Fatima Khatun",
        "creatorEmail": "fatima.khatun@gmail.com",
        "title": "Tree Plantation Campaign in Dhanmondi Lake Area",
        "location": "Dhanmondi Lake, Dhaka",
        "eventType": "Environment",
        "thumbnail": "https://images.unsplash.com/photo-1542601906990-b4d3fb778b09?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-08-15T06:00:00.000Z",
        "details": "Join us for a massive tree plantation drive around the beautiful Dhanmondi Lake area. We aim to plant over 500 saplings including native species like mahogany, rain tree, and neem. This environmental initiative will help combat air pollution, provide shade, and enhance the natural beauty of one of Dhaka's most cherished recreational spots. We'll provide all saplings, gardening tools, and protective equipment. Expert botanists will guide participants on proper planting techniques and tree care. The event includes awareness sessions on environmental conservation and the importance of urban greenery. Light refreshments and certificates of participation will be provided to all volunteers.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1494790108755-2616b612b786?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Mohammad Ali Hassan",
        "creatorEmail": "ali.hassan.community@gmail.com",
        "title": "Free Computer Literacy Workshop for Underprivileged Youth",
        "location": "Tejgaon Community Center, Dhaka",
        "eventType": "Education",
        "thumbnail": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-09-20T08:00:00.000Z",
        "details": "Empowering the next generation through technology education. This comprehensive 3-day workshop will teach basic computer skills, internet usage, and digital literacy to underprivileged youth aged 14-25. Topics include Microsoft Office basics, email communication, online safety, and job search techniques. We have partnered with local IT professionals who will serve as volunteer instructors. Each participant will receive hands-on training with individual computer access, printed materials, and completion certificates that can enhance their employment prospects. The workshop is completely free and includes lunch for all three days. Priority will be given to students from low-income families.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1472099645785-5658abf4ff4e?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Rashida Begum",
        "creatorEmail": "rashida.social.worker@gmail.com",
        "title": "Women's Health Awareness and Free Medical Checkup Camp",
        "location": "Uttara Sector 7 Community Hall, Dhaka",
        "eventType": "Healthcare",
        "thumbnail": "https://images.unsplash.com/photo-1559757148-5c350d0d3c56?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-10-12T07:00:00.000Z",
        "details": "A comprehensive women's health initiative providing free medical consultations, basic health screenings, and awareness sessions. Qualified female doctors and nurses will conduct blood pressure checks, diabetes screening, basic gynecological consultations, and nutritional assessments. The event features educational sessions on maternal health, family planning, nutrition during pregnancy, and preventive healthcare measures. We'll distribute free health supplements, hygiene kits, and informational brochures in Bengali. Registration is required due to limited capacity. All services are provided free of charge, and strict privacy protocols will be maintained. Childcare assistance will be available for mothers attending the camp.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1594824911330-29c5f5297c0a?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Karim Uddin",
        "creatorEmail": "karim.volunteer.bd@gmail.com",
        "title": "Winter Clothes Distribution Drive for Street Children",
        "location": "Kamrangirchar Slum Area, Dhaka",
        "eventType": "Charity",
        "thumbnail": "https://images.unsplash.com/photo-1488521787991-ed7bbaae773c?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-12-18T08:00:00.000Z",
        "details": "Help us bring warmth and hope to underprivileged street children during the cold winter months. We're organizing a massive clothing distribution drive to provide warm clothes, blankets, and essential items to over 300 street children in the Kamrangirchar area. The drive includes new and gently used winter clothing, warm blankets, socks, shoes, and basic toiletries. Volunteers will help with sorting, packing, and distributing items directly to children and their families. We'll also provide warm meals and basic medical checkups through our mobile health unit. Local social workers will assist in identifying the most needy families. This initiative aims to provide dignity and comfort to those who need it most during harsh weather conditions.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Nusrat Jahan",
        "creatorEmail": "nusrat.education.activist@gmail.com",
        "title": "Mobile Library and Reading Program for Rural Children",
        "location": "Savar Upazila Primary Schools",
        "eventType": "Education",
        "thumbnail": "https://images.unsplash.com/photo-1481627834876-b7833e8f5570?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-11-08T09:00:00.000Z",
        "details": "Bringing books and literacy directly to rural communities through our innovative mobile library program. We'll visit 5 primary schools in Savar Upazila over the weekend, setting up temporary reading spaces and conducting interactive storytelling sessions. The program includes age-appropriate books in Bengali and English, educational games, and creative writing workshops. Volunteer teachers and university students will lead reading circles and help children develop their literacy skills. Each participating school will receive a collection of donated books to start their own mini-library. We'll also distribute school supplies including notebooks, pencils, and educational posters. The goal is to foster a love of reading and learning among rural children who have limited access to quality books and educational resources.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1438761681033-6461ffad8d80?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Dr. Abdul Rahman",
        "creatorEmail": "dr.rahman.community@gmail.com",
        "title": "Blood Donation Camp and Health Awareness Program",
        "location": "Dhaka Medical College Hospital Premises",
        "eventType": "Healthcare",
        "thumbnail": "https://images.unsplash.com/photo-1615461066841-6116e61058f4?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-09-05T06:30:00.000Z",
        "details": "Save lives by donating blood and spreading health awareness in our community. This large-scale blood donation camp aims to collect 200+ units of blood for the national blood bank. All donors will receive free health screenings including blood pressure, hemoglobin levels, and basic medical consultations. Qualified medical staff will ensure safe and hygienic blood collection procedures. The event also features health awareness sessions on the importance of regular blood donation, maintaining good health, and preventing communicable diseases. Light refreshments and donor certificates will be provided to all participants. Donors must be aged 18-60, weigh at least 50kg, and be in good health. Pre-registration is encouraged but walk-ins are welcome.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1612349317150-e413f6a5b16d?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Salma Khatun",
        "creatorEmail": "salma.green.dhaka@gmail.com",
        "title": "Plastic-Free Dhaka Initiative and Awareness Campaign",
        "location": "New Market Area, Dhaka",
        "eventType": "Environment",
        "thumbnail": "https://images.unsplash.com/photo-1576037728058-ab2c538ac8d0?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-07-25T16:00:00.000Z",
        "details": "Join our mission to make Dhaka plastic-free through community action and awareness. This campaign will focus on educating shoppers and vendors about the harmful effects of single-use plastics and promoting eco-friendly alternatives. Volunteers will distribute reusable jute bags, paper bags, and provide information about sustainable shopping practices. We'll set up information booths displaying the environmental impact of plastic pollution and demonstrate alternatives like cloth bags, bamboo products, and biodegradable packaging. The initiative includes a plastic waste collection drive where participants can bring their plastic waste for proper recycling. Local businesses will be encouraged to adopt plastic-free practices through our partnership program. Together, we can create a cleaner, more sustainable Dhaka for future generations.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1494790108755-2616b612b786?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Hassan Ahmed",
        "creatorEmail": "hassan.skills.development@gmail.com",
        "title": "Free Skill Development Workshop: Tailoring and Embroidery",
        "location": "Wari Women's Community Center, Dhaka",
        "eventType": "Skill Development",
        "thumbnail": "https://images.unsplash.com/photo-1558618666-fcd25c85cd64?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-10-28T08:30:00.000Z",
        "details": "Empower women with valuable vocational skills through our comprehensive tailoring and embroidery workshop. This 5-day intensive program will teach participants basic to intermediate sewing techniques, pattern making, garment construction, and traditional embroidery methods. Expert tailors and craftswomen will provide hands-on training with individual sewing machines and materials provided free of charge. The workshop covers measuring techniques, fabric selection, basic alterations, and small business principles for those interested in starting their own tailoring business. Participants will complete practical projects they can take home and receive certificates of completion. The program is specifically designed for women seeking economic independence and skill enhancement. All materials, tools, and refreshments are provided at no cost.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Mahmudur Rahman",
        "creatorEmail": "mahmud.community.kitchen@gmail.com",
        "title": "Community Kitchen for Daily Wage Workers and Homeless",
        "location": "Sadarghat Launch Terminal Area, Dhaka",
        "eventType": "Food Distribution",
        "thumbnail": "https://images.unsplash.com/photo-1628717341663-0007b0ee2597?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-08-30T05:00:00.000Z",
        "details": "Providing nutritious meals to daily wage workers, rickshaw pullers, and homeless individuals in the busy Sadarghat area. Our community kitchen will serve freshly prepared hot meals including rice, lentils, vegetables, and protein to over 400 people daily for one week. The initiative aims to support those who struggle to afford regular meals due to economic hardship or unemployment. Volunteers will help with meal preparation, serving, and cleanup under the guidance of experienced cooks. We'll maintain strict hygiene standards and ensure meals are culturally appropriate and nutritious. The program also includes distribution of clean drinking water and basic first aid services. Local businesses and individuals have contributed ingredients and funding to make this initiative possible. This is more than just food distribution – it's about showing compassion and building community solidarity.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1472099645785-5658abf4ff4e?w=96&h=96&fit=crop&auto=format",
        "participants": []
    },
    {
        "creatorName": "Ahmed Rahman",
        "creatorEmail": "ahmed.rahman@gmail.com",
        "title": "Road Cleaning Drive in Mirpur 10, Dhaka",
        "location": "Mirpur 10, Dhaka",
        "eventType": "Clean Up",
        "thumbnail": "https://images.unsplash.com/photo-1659004249963-1c1bdecfcbb8?w=800&h=500&fit=crop&auto=format",
        "eventDate": "2025-07-15T06:00:00.000Z",
        "details": "Join our community initiative to clean the main roads and surrounding areas of Mirpur 10. This cleanup drive aims to remove litter, plastic waste, and debris from sidewalks, drainage systems, and public spaces. We'll provide all necessary cleaning equipment including brooms, garbage bags, gloves, and safety vests. The event will start early morning to avoid traffic congestion and ensure maximum impact. Volunteers will be divided into teams to cover different sections of the area. Refreshments and light breakfast will be provided to all participants. This initiative is part of our ongoing effort to create a cleaner, healthier environment for our community and set an example for neighboring areas.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=150&h=150&fit=crop&crop=face",
        "participants": []
    },
    {
        "creatorName": "Nasir Uddin",
        "creatorEmail": "nasir.uddin@gmail.com",
        "title": "Tree Plantation - Hossainpur, Kishoreganj",
        "location": "Hossainpur, Kishoreganj",
        "eventType": "Environment",
        "thumbnail": "https://images.unsplash.com/photo-1441974231531-c6227db76b6e?w=800&h=500&fit=crop",
        "eventDate": "2025-07-22T07:00:00.000Z",
        "details": "Help us plant 500 native tree saplings in the Hossainpur area to combat climate change and create a greener, more sustainable environment for future generations. This comprehensive plantation drive will focus on indigenous species that are well-adapted to our local climate and soil conditions. We will plant fruit trees, medicinal plants, and timber trees in designated areas with proper spacing and care instructions. Professional horticulturists will guide participants on proper planting techniques, soil preparation, and initial care requirements. All necessary tools including spades, watering cans, and organic fertilizers will be provided. The event includes an educational session about the importance of reforestation and its impact on local biodiversity. Lunch and transportation from Dhaka will be arranged for all volunteers. Each participant will receive a certificate and follow-up information about the trees they planted.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1500648767791-00dcc994a43e?w=150&h=150&fit=crop&crop=face",
        "participants": []
    },
    {
        "creatorName": "Shahida Islam",
        "creatorEmail": "shahida.islam@gmail.com",
        "title": "Winter Clothing Donation Drive - Old Dhaka",
        "location": "Lalbagh, Old Dhaka",
        "eventType": "Charity",
        "thumbnail": "https://images.unsplash.com/photo-1532629345422-7515f3d16bb6?w=800&h=500&fit=crop",
        "eventDate": "2025-07-18T08:00:00.000Z",
        "details": "Organize and distribute warm winter clothing for underprivileged families and homeless individuals in the historic Old Dhaka area. This comprehensive donation drive aims to collect gently used and new winter items including jackets, sweaters, blankets, scarves, gloves, and warm socks. We will set up collection points throughout the day and sort items by size and condition. Local community leaders will help us identify families most in need, ensuring fair and efficient distribution. Volunteers will help with organizing donations, packing items into family-sized bundles, and directly distributing to beneficiaries. We also welcome monetary contributions to purchase new warm clothes for children and elderly people. The event will include a brief orientation about respectful donation practices and cultural sensitivity. Refreshments will be provided for all volunteers, and we'll document the impact of our collective effort to share with contributors.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1487412720507-e7ab37603c6f?w=150&h=150&fit=crop&crop=face",
        "participants": []
    },
    {
        "creatorName": "Tanim Hoque",
        "creatorEmail": "tanim.hoque@gmail.com",
        "title": "Beach Cleanup - Cox's Bazar",
        "location": "Cox's Bazar Beach",
        "eventType": "Clean Up",
        "thumbnail": "https://images.unsplash.com/photo-1583212292454-1fe6229603b7?w=800&h=500&fit=crop",
        "eventDate": "2025-08-05T05:30:00.000Z",
        "details": "Join us for a massive beach cleanup initiative at the world's longest natural sea beach, Cox's Bazar. This environmental conservation effort aims to remove plastic waste, debris, and litter that threatens marine life and pollutes our beautiful coastline. Volunteers will work in organized teams to cover different sections of the beach, focusing on both visible waste and buried plastic items. We'll provide all necessary equipment including reusable gloves, collection bags, picking tools, and safety equipment. The cleanup will be followed by an educational session about marine conservation and the impact of plastic pollution on ocean ecosystems. Professional environmental experts will guide us on proper waste sorting and recycling techniques. Transportation from Dhaka will be arranged via comfortable air-conditioned buses, and accommodation can be arranged for out-of-town volunteers. The event includes meals, refreshments, and a closing ceremony to celebrate our collective environmental impact.",
        "creatorPhotoURL": "https://images.unsplash.com/photo-1519085360753-af0119f7cbe7?w=150&h=150&fit=crop&crop=face",
        "participants": []
    }
]
